{"questions": [
["Hi teenager, how are you feeling today?"],
[
"How does your family cope with the challenges of having a disabled child?",
"Have you noticed any positive changes in your family since your sibling was diagnosed?",
"Do you feel like your parents are doing their best to support both you and your disabled sibling?",
"Are there specific things you wish your family would do differently to improve the situation?",
"Have you tried talking to your parents about how you feel?"
],

[
"How do you typically spend your time when you're feeling down or sad?",
"Are there certain activities that you find helpful when you're feeling low?",
"Do you prefer to be alone or with others when you're feeling down?",
"Have you tried reaching out to friends or family members for support?",
"Are there any hobbies or interests that help you feel better?",
"Have you thought about talking to a therapist or counselor?"
],
[
"Do you feel like you are heard in your family or are your feelings often ignored?",
"Have you ever felt like your opinions or needs were overlooked in your family?",
"Are there certain family members whom you feel comfortable talking to about your feelings?",
"Is there anything your family could do to make you feel more heard and valued?",
"Have you tried standing up for yourself when you feel like you're being ignored?",
"Are there times when you feel like your family is particularly supportive and understanding?"
],

[
"How do you usually deal with negative feelings or thoughts when you experience them?",
"Have you ever tried mindfulness or relaxation techniques to calm your mind?",
"Do you find it helpful to talk to someone when you're feeling upset?",
"Are there any specific things that tend to trigger negative thoughts or emotions for you?",
"Have you tried keeping a journal to track your mood and symptoms?",
"Are there any healthy coping mechanisms that you've found particularly effective?"
],
[
"Do you have someone to talk to when you feel upset or depressed?",
"Do you feel like you have a strong support network of friends and family members?",
"Have you considered joining a support group or online forum for people in similar situations?",
"Are there any specific people in your life whom you feel comfortable confiding in?",
"Have you ever talked to a therapist or counselor about your feelings?",
"Do you feel like you can usually handle your negative emotions on your own, or do you need more support?"
],
[
"Have you noticed any changes in your mood or behavior lately?",
"Have you noticed any triggers that seem to make your mood or behavior worse?",
"Has anyone else in your life commented on changes in your mood or behavior?",
"Are there any changes in your life that might be causing stress or anxiety?",
"Have you tried making any changes to your routine or lifestyle habits to improve your mood?",
"Are there any positive changes you've noticed in your mood or behavior recently?"
],
[
"Do you feel like you have control over your thoughts and emotions, or do they sometimes control you?",
"How do you typically react when you experience strong emotions?",
"Have you noticed any patterns in your thinking or behavior that relate to your emotions?",
"Are there any specific techniques or strategies that you use to manage your thoughts and emotions?",
"Have you tried talking to a mental health professional about your thoughts and emotions?",
"Are there any areas of your life where you feel like you have more control or agency?"
],
[
"What do you think would be helpful for you right now to improve your mood and well-being?",
"Are there any activities or hobbies you enjoy that you haven't had time for lately?",
"Have you considered trying a new form of exercise or physical activity?",
"Are there any books, podcasts, or other media that you find inspiring or motivating?",
"Would you feel comfortable talking to a mental health professional about your current struggles?",
"Are there any changes you could make to your environment or daily routine that might improve your mood and well-being?"
],
[
"How do you feel about being a family member of a disabled child?",
"Have you ever talked to your sibling with the disability about how they feel?",
"Are there any support systems or resources available to you as a family member?",
"Have you learned anything about disability rights or advocacy that you find inspiring or interesting?",
"Are there any ways you've found to bond with your sibling despite the challenges?",
"Have you thought about volunteering or working with organizations that support individuals with disabilities?"
],
[
"Can you share with me how you cope with challenging situations at home?",
"Are there any particular situations that tend to be more difficult than others?",
"Have you tried talking to other family members about your coping strategies?",
"Are there any coping strategies you've found to be ineffective or even harmful?",
"Have you considered talking to a professional therapist or counselor about your experiences?",
"Are there any skills or strengths you've developed as a result of your family situation?"
],
[""]
]
}